Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_regdef.h
/** \brief Time-Stamp Counter ${i} */
typedef struct _Ifx_EDSADC_CH_TSCNT_Bits
{
    Ifx_UReg_32Bit TSCOUNT:16;        /**< \brief [15:0] Timestamp Counter Value - TSCOUNT (rh) */
    Ifx_UReg_32Bit TSCLK:2;           /**< \brief [17:16] Timestamp Counter Clock Selection - TSCLK (rw) */
    Ifx_UReg_32Bit reserved_18:1;     /**< \brief [18:18] \internal Reserved */
    Ifx_UReg_32Bit TSCRUN:1;          /**< \brief [19:19] Timestamp Counter Run Control - TSCRUN (rw) */
    Ifx_UReg_32Bit AMXCOPY:1;         /**< \brief [20:20] Analog MUX Setting Copy Enable - AMXCOPY (rw) */
    Ifx_UReg_32Bit reserved_21:11;    /**< \brief [31:21] \internal Reserved */
} Ifx_EDSADC_CH_TSCNT_Bits;

/** \brief Time-Stamp Register ${i} */
typedef struct _Ifx_EDSADC_CH_TSTMP_Bits
{
    Ifx_UReg_32Bit TIMESTAMP:16;      /**< \brief [15:0] The Most Recent Captured Timestamp Value - TIMESTAMP (rh) */
    Ifx_UReg_32Bit AMX:2;             /**< \brief [17:16] Analog Multiplexer Setting - AMX (rh) */
    Ifx_UReg_32Bit reserved_18:13;    /**< \brief [30:18] \internal Reserved */
    Ifx_UReg_32Bit TSVAL:1;           /**< \brief [31:31] Timestamp Valid - TSVAL (rh) */
} Ifx_EDSADC_CH_TSTMP_Bits;

/** \brief Common Mode Voltage Register ${i} */
typedef struct _Ifx_EDSADC_CH_VCM_Bits
{
    Ifx_UReg_32Bit VREFXSEL:2;        /**< \brief [1:0] Fractional Reference Voltage Selection - VREFXSEL (rw) */
    Ifx_UReg_32Bit VXON:1;            /**< \brief [2:2] Fractional Reference Voltage Enable - VXON (rw) */
    Ifx_UReg_32Bit reserved_3:13;     /**< \brief [15:3] \internal Reserved */
    Ifx_UReg_32Bit INPVC0:1;          /**< \brief [16:16] Voltage Control of Positive Inputs 0-3 of CHx - INPVC0,INPVC1,INPVC2,INPVC3 (rw) */
    Ifx_UReg_32Bit INPVC1:1;          /**< \brief [17:17] Voltage Control of Positive Inputs 0-3 of CHx - INPVC0,INPVC1,INPVC2,INPVC3 (rw) */
    Ifx_UReg_32Bit INPVC2:1;          /**< \brief [18:18] Voltage Control of Positive Inputs 0-3 of CHx - INPVC0,INPVC1,INPVC2,INPVC3 (rw) */
    Ifx_UReg_32Bit INPVC3:1;          /**< \brief [19:19] Voltage Control of Positive Inputs 0-3 of CHx - INPVC0,INPVC1,INPVC2,INPVC3 (rw) */
    Ifx_UReg_32Bit INNVC0:1;          /**< \brief [20:20] Voltage Control of Negative Inputs 0-3 of CHx - INNVC0,INNVC1,INNVC2,INNVC3 (rw) */
    Ifx_UReg_32Bit INNVC1:1;          /**< \brief [21:21] Voltage Control of Negative Inputs 0-3 of CHx - INNVC0,INNVC1,INNVC2,INNVC3 (rw) */
    Ifx_UReg_32Bit INNVC2:1;          /**< \brief [22:22] Voltage Control of Negative Inputs 0-3 of CHx - INNVC0,INNVC1,INNVC2,INNVC3 (rw) */
    Ifx_UReg_32Bit INNVC3:1;          /**< \brief [23:23] Voltage Control of Negative Inputs 0-3 of CHx - INNVC0,INNVC1,INNVC2,INNVC3 (rw) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_EDSADC_CH_VCM_Bits;

/** \brief Clock Control Register */
typedef struct _Ifx_EDSADC_CLC_Bits
{
    Ifx_UReg_32Bit DISR:1;            /**< \brief [0:0] Module Disable Request Bit - DISR (rw) */
    Ifx_UReg_32Bit DISS:1;            /**< \brief [1:1] Module Disable Status Bit - DISS (rh) */
    Ifx_UReg_32Bit reserved_2:1;      /**< \brief [2:2] \internal Reserved */
    Ifx_UReg_32Bit EDIS:1;            /**< \brief [3:3] Sleep Mode Enable Control - EDIS (rw) */
    Ifx_UReg_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_EDSADC_CLC_Bits;

/** \brief Event Flag Register */
typedef struct _Ifx_EDSADC_EVFLAG_Bits
{
    Ifx_UReg_32Bit RESEV0:1;          /**< \brief [0:0] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV1:1;          /**< \brief [1:1] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV2:1;          /**< \brief [2:2] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV3:1;          /**< \brief [3:3] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV4:1;          /**< \brief [4:4] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV5:1;          /**< \brief [5:5] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV6:1;          /**< \brief [6:6] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV7:1;          /**< \brief [7:7] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV8:1;          /**< \brief [8:8] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV9:1;          /**< \brief [9:9] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV10:1;         /**< \brief [10:10] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV11:1;         /**< \brief [11:11] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV12:1;         /**< \brief [12:12] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit RESEV13:1;         /**< \brief [13:13] Result Event - RESEV${x} (rwh) */
    Ifx_UReg_32Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
    Ifx_UReg_32Bit ALEV0:1;           /**< \brief [16:16] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV1:1;           /**< \brief [17:17] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV2:1;           /**< \brief [18:18] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV3:1;           /**< \brief [19:19] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV4:1;           /**< \brief [20:20] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV5:1;           /**< \brief [21:21] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV6:1;           /**< \brief [22:22] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV7:1;           /**< \brief [23:23] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV8:1;           /**< \brief [24:24] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV9:1;           /**< \brief [25:25] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV10:1;          /**< \brief [26:26] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV11:1;          /**< \brief [27:27] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV12:1;          /**< \brief [28:28] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit ALEV13:1;          /**< \brief [29:29] Alarm Event - ALEV${x} (rwh) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_EDSADC_EVFLAG_Bits;

/** \brief Event Flag Clear Register */
typedef struct _Ifx_EDSADC_EVFLAGCLR_Bits
{
    Ifx_UReg_32Bit RESEC0:1;          /**< \brief [0:0] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC1:1;          /**< \brief [1:1] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC2:1;          /**< \brief [2:2] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC3:1;          /**< \brief [3:3] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC4:1;          /**< \brief [4:4] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC5:1;          /**< \brief [5:5] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC6:1;          /**< \brief [6:6] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC7:1;          /**< \brief [7:7] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC8:1;          /**< \brief [8:8] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC9:1;          /**< \brief [9:9] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC10:1;         /**< \brief [10:10] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC11:1;         /**< \brief [11:11] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC12:1;         /**< \brief [12:12] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit RESEC13:1;         /**< \brief [13:13] Result Event Clear - RESEC${x} (w) */
    Ifx_UReg_32Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
    Ifx_UReg_32Bit ALEC0:1;           /**< \brief [16:16] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC1:1;           /**< \brief [17:17] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC2:1;           /**< \brief [18:18] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC3:1;           /**< \brief [19:19] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC4:1;           /**< \brief [20:20] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC5:1;           /**< \brief [21:21] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC6:1;           /**< \brief [22:22] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC7:1;           /**< \brief [23:23] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC8:1;           /**< \brief [24:24] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC9:1;           /**< \brief [25:25] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC10:1;          /**< \brief [26:26] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC11:1;          /**< \brief [27:27] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC12:1;          /**< \brief [28:28] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit ALEC13:1;          /**< \brief [29:29] Alarm Event Clear - ALEC${x} (w) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_EDSADC_EVFLAGCLR_Bits;

/** \brief Global Configuration Register */
typedef struct _Ifx_EDSADC_GLOBCFG_Bits
{
    Ifx_UReg_32Bit reserved_0:8;      /**< \brief [7:0] \internal Reserved */
    Ifx_UReg_32Bit DITRIM:3;          /**< \brief [10:8] Trimming Value for the Dithering Function - DITRIM (rw) */
    Ifx_UReg_32Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit USC:1;             /**< \brief [12:12] Unsynchronized Clock Generation - USC (rw) */
    Ifx_UReg_32Bit SUPLEV:2;          /**< \brief [14:13] Supply Voltage Level - SUPLEV (rw) */
    Ifx_UReg_32Bit CPWC:1;            /**< \brief [15:15] Write Control for Clock Parameters - CPWC (w) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_EDSADC_GLOBCFG_Bits;

/** \brief Global Run Control Register */
typedef struct _Ifx_EDSADC_GLOBRC_Bits
{
    Ifx_UReg_32Bit CHRUN0:1;          /**< \brief [0:0] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN1:1;          /**< \brief [1:1] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN2:1;          /**< \brief [2:2] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN3:1;          /**< \brief [3:3] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN4:1;          /**< \brief [4:4] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN5:1;          /**< \brief [5:5] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN6:1;          /**< \brief [6:6] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN7:1;          /**< \brief [7:7] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN8:1;          /**< \brief [8:8] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN9:1;          /**< \brief [9:9] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN10:1;         /**< \brief [10:10] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN11:1;         /**< \brief [11:11] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN12:1;         /**< \brief [12:12] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit CHRUN13:1;         /**< \brief [13:13] Channel ${x} Run Control - CH${x}RUN (rw) */
    Ifx_UReg_32Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
    Ifx_UReg_32Bit MRUN0:1;           /**< \brief [16:16] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN1:1;           /**< \brief [17:17] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN2:1;           /**< \brief [18:18] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN3:1;           /**< \brief [19:19] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN4:1;           /**< \brief [20:20] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN5:1;           /**< \brief [21:21] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN6:1;           /**< \brief [22:22] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN7:1;           /**< \brief [23:23] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN8:1;           /**< \brief [24:24] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN9:1;           /**< \brief [25:25] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN10:1;          /**< \brief [26:26] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN11:1;          /**< \brief [27:27] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN12:1;          /**< \brief [28:28] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit MRUN13:1;          /**< \brief [29:29] Modulator ${x} Run Control - M${x}RUN (rw) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_EDSADC_GLOBRC_Bits;

